package main

import "testing"

func TestNumericToString(t *testing.T) {
	cases := []struct {
		n uint
		s string
	}{
		{0, "ноль"},
		{1, "одна"},
		{2, "две"},
		{3, "три"},
		{4, "четыре"},
		{5, "пять"},
		{6, "шесть"},
		{7, "семь"},
		{8, "восемь"},
		{9, "девять"},
		{10, "десять"},
		{11, "одиннадцать"},
		{12, "двенадцать"},
		{13, "тринадцать"},
		{14, "четырнадцать"},
		{15, "пятнадцать"},
		{16, "шестнадцать"},
		{17, "семнадцать"},
		{18, "восемнадцать"},
		{19, "девятнадцать"},
		{20, "двадцать"},
		{21, "двадцать одна"},
		{32, "тридцать две"},
		{43, "сорок три"},
		{54, "пятьдесят четыре"},
		{65, "шестьдесят пять"},
		{76, "семьдесят шесть"},
		{87, "восемьдесят семь"},
		{98, "девяносто восемь"},
		{100, "сто"},
		{104, "сто четыре"},
		{200, "двести"},
		{211, "двести одиннадцать"},
		{325, "триста двадцать пять"},
		{490, "четыреста девяносто"},
		{561, "пятьсот шестьдесят одна"},
		{644, "шестьсот сорок четыре"},
		{792, "семьсот девяносто две"},
		{855, "восемьсот пятьдесят пять"},
		{937, "девятьсот тридцать семь"},
	}

	for _, c := range cases {
		got := numericToString(c.n)
		if got != c.s {
			t.Errorf("Ожидание: %d->'%s'. Реальность: '%s'", c.n, c.s, got)
		}
	}
}
